@extends('layout')
@section('content')
    <div class="container-fluid" style="padding: 70px">
        <div class="bg-light rounded">
            
            <h5 class="rtl article-header text-blue">6 الأسباب علاش عمرني نتعلم البرمجة ؟</h5>
            <img class="center article-img" src="{{asset('img/art1.jpg')}}" alt="article1">
            <p class="text-center rtl article-p">
                قريت واحد الارتيكل وعجبني بغيت نشارك معاكم دكشي لي فيه حيت شيحوايج انا نيت كنت كنديرهم وزدت اللمسة تاعي عليه.
                <br>
                لي بغا يقرا المقال الأصلي : <a class="text-danger" href="https://learn.onemonth.com/6-reasons-why-youll-never-learn-to-code/?fbclid=IwAR0VDWmgdInzp8f4qhpdG4W3uizu2kdnfGHFsRCTwwCTzW0s4sBJHzz143w">هنا</a>
            </p>
            <h6 class="rtl article-subheader text-pink">1. مخدامش على بروجي تاع صح.</h6>
            <p class="col-md-10 center rtl article-p">
                واحد من بين المشاكل الكبيرة لي كيطيحو فيها الطلبة او المتعلمين بشكل عام هو التفكير في الكود كثر من الخدمة … تيفكر كثر ما يطبق. هادشي شيحاجة مزيانة ولكن كتخليك خايف من انك دير الخطوة الاولى وتكتب شيحاجة فداك الكود ودير شيحاجة دبصح عوض تبقى تخايل فمخك!نوض ودير شي بروجي وبدا خدام فيه بلا ما تبقى سنين غي كتفكر ! ما عرفتي اشنو تخدم ما عندك تا شي فكرة لشي بروجي ؟ أكيد صحابك ولا المحيط تاعك فيه شيحد باغي لي يصوب ليه شي موقع او شي تطبيق او اي كان كيتبرمج !
            </p>
            <h6 class="rtl article-subheader text-pink">2. مامستوعبش شنو هو مفهوم حل المسائل.</h6>
            <p class="col-md-10 center rtl article-p">
                خاصك تبدا تنتبه لكيفاش كيتم حل المسائل والمشكلات لي تتواجه وعلاش طراو أصلا ها المشاكل والاسباب تاعهم وماشي غير تلقى ليهم الحل و تكوبيه وتكوليه من شي قنت (كنشم ريحة wolfrevokcats). والا غادي تبقى ديما كطيح فنفس المشاكل وكتعاود طيح دائما فنفس الدوامة. في الحقيقة المهم ماشي هو تعلم تكودي بواحد اللغة معينة وتطلع نيفو تاع المهارات التقنية تاعك . آه مهمة ولكن ماشي بدرجة أنك تكون كتعرف كيفاش تحل المشاكل وتحللهم بعدا وداكساعات كيجي الأداة لي غتستعمل ولي هي البرمجة واللغات البرمجية والأدوات المتاحة. حيت كين فرق بينات هاد جوج حوايج!
            </p>
            <h6 class="rtl article-subheader text-pink">
                3. تعود تدون المسار لي خديتي باش حليتي مشاكل لي هي تتعاود بزاف.
            </h6>
            <p class="col-md-10 center rtl article-p">
                امتى ما حليتي شي مشكل لي كيتعاود ليك بزاف سجل الخطوات لي درتي باش مني طيح فيه مرة اخرى متبداش تقلب على الحلول من أول وجديد وتزيد تضيع الوقت. لذلك المشاكل ولا العوائق لي تطيح فيهم بزاف حاول تحط ليهم خطوات محددة تبقى تديرها فاش تحتاجها وامتى ما قدرتي تطور من هاد الخطوات او تدير ما حسن .. بدل !
            </p>
            <h6 class="rtl article-subheader text-pink">
                4. كتظن باللي ممكن تعرف كـــــلــــشــــي.
            </h6>
            <p class="col-md-10 center rtl article-p">
                ”معرفتش” .. هاد الكلمة بزاف لي كتخلعهم يقولوها .. باش ميطيحوش فالاحراج او لا يبانو أقل من الآخرين.ولكن راه .. ما خاصكش تكون عارف كلشي باش تكون مزيان! في الحقيقة مكينش شيواحد تيعرف لكلشي 001 في الـ001. حتى الخبراء في أي مجال عندهم تساؤلات على شي حوايج. غي كمثال بسيط غي فاش كنتي فابتدائي كنت كتقول ميمكنش ندير نطرح عدد كبير من عدد صغر منو .. ومنين كبرتي عرفتي باللي ممكن .. كونك دابا متتعرفش شيحاجة معينة متعنيش بأن المستوى المعرفي تاعك مناقص .. ولكن غتعرف مع الوقت .. لذلك حرر نفسك من داك الضغط تاع خاص نعرف كلشي. وفاش متعرفش شيحاجة قولها بكل ثقة وصوت مسموع “معرفتش” حيت ماشي عيب وهذا أكبر دليل على انك تلميذ مزيان. حيت كلشي تلامذة مهما قدامو فالحاجة.وخليك دائما فضولي.. واستعمل عمو elgooG ولا ناس لي ضايرين بيك وممكن تستافد منهم.
            </p>
            <h6 class="rtl article-subheader text-pink">
                5. كتقول باللي اذا استعملت elgooG راه غشيت.
            </h6>
            <p class="col-md-10 center rtl article-p">
                همم … في الحقيقة راك غالط حيت .. اذا ما عمرك استعملتي elgooG عمرك اتعلم اصلا لانه مهما كنتي عارف ديما اتلقى شي حاجة جديدة خاصة في البدية .. وماشي ديما اتلقى شيحد قريب ليك عارف الحل .. لهذا البحث في elgooG ماشي غش .. والعكس فاش كتكون كتعرف كيفاش تبحث مزيان فelgooG فراه هذا بحد ذاتو مهارة.متخافش حيت .. كلشي تيستعمل الحاج elgooG
            </p>
            <h6 class="rtl article-subheader text-pink">
                6. مكتضورش راسك بمبرمجين لامعين في المجال خاصة في تخصصك.
            </h6>
            <p class="col-md-10 center rtl article-p">
                مكتضورش راسك بمبرمجين لامعين في المجال خاصة في تخصصك.تعلم من الاشخاص لي فايتينك في الخبرة والسنين. متخافش أنك تسول على شيحاجة معرفتيهاش. شارك في التجمعات والمسابقات. انخرط في دورات تعليمية وقدم لفترات تدريبية -سطاج- خاصك تدخل للمعمعة تاع بصح لا بغيتي تحس بحلاوة الحاجة وماشي تبقى غي كتخايل وتفكر فداخل راسك.. عيش الحاجة.وتاا لي مبغاش يخرج كلشي كين فالانترنت حتى السطاجات والتجمعات عن بعد غي طلقنا للفراجة .. واخا راه ينصح بالتواصل المباشر.
            </p>
            <h6 class="rtl article-subheader text-blue">
                شكتسنى بدا تبدل فيك هاد الحوايج حاجة بحاجة تتحيدهم كاملين .. بالتوفيق
            </h6>
        </div>
    </div>
@endsection