@extends('layout')
@section('content')
    <div class="container-fluid" style="padding: 30px">
        <div class="bg-light rounded">            
            <img class="center article-img" src="{{asset('img/art2.png')}}" alt="article2-1">
            <p class="col-md-10 center rtl article-p">
                اليوم غنشارككم طريقتي كيفاش تنظم وقتي والخدمة ديالي باش ميدوزش عندي نهار خاوي ولا مخربق. وهدشي انطلاقا من تجربتي المتواضعة والخاصة, لذلك ممكن يلائمك كيفما ممكن العكس. لكن, متاكدة فكلتا الحالتين اتستافد ولو حاجة وحدة.
            </p>
            <p class="col-md-10 center rtl article-p">
                كنظن ماشي بوحدي لي كنت كندير جدول زمني تنظم فيه كلشي الحوايج لي خاصني ندير في النهار بالدقيقة والساعة.. وفي الاخير اكيد… متنديرهمش ولا متنكملهمش ولا من اللول تنبقا تاني نأجل أو فاش تنفوت الوقت تاع شيحاجة تيبقا فيا الحال وتندير لشي الاخر بناقص.
            </p>
            <p class="col-md-10 center rtl article-p">
                جربت ندير غي الحوايج الاساسيين في الجدول وجربت ندير انشطتي بالتفاصيل وتاواحدة منفعات معايا صراحة.
            </p>
            <p class="col-md-10 center rtl article-p">
                ولكن أكيد بعد محاولات عديدة وكل مرة كنشوف أشنو الحاجة لي كتخليني منتبعش داك الجدول الزمني. عرفت باللي أنا اصلا مكنحملش الحقيقة تاع أنني مقيدة بواحد الوقت معين لذلك حاولت ندير واحد TSIL OD OT ولا لائحة بدكشي لي باغا ندير فالنهار.وصراحة فاللول تاهي منفعاتش بحيث كنت كنبقى نفكر خاصني نرتبهم حسب الوقت امتاش غندير كل حاجة وهنا تاني كنت كنطيح فاحباط فاش متنديرش شيحاجة.
            </p>
            <p class="col-md-10 center rtl article-p">
                الى حين أنني واخيرا لقيت حل .. بما أنه داك قوة الترتيب شخصيا تتجيب ليا العكز او الاحباط فا تنلقى داز نهار ومتبعتوش و بما انه متنبغيش نكون واعية بأنني مقيدة بشروط زمنية ولا معنوية خاصة انه شي مرات كيختلف الوقت لي اترشق ليا فيه ندير الحاجة.
            </p>
            <p class="col-md-10 center rtl article-p">
                الشهور الاخيرة وليت كندير واحد الطريقة وحمد لله دكشي لي تيكون خاصني نديرو فالنهار تنديرو. لكن قبلما نقوليكم العصارة ديال تجربتي فهاد عامين اللخرة, فكنبغي نقوليكم باللي ماشي بالضرورة تدير الطرق المعروفة والشائعة بحال لي حاولت ندير فاللول ولكن المهم هو تلقى طريقتك الخاصة لي مسلكاك ممكن تكون من دوك الطرق ممكن تكون خليط مبيناتهم -بحال الحالة تاعتي- ممكن تكون طريقة اخرى تخترعها لنفسك
            </p>
            <p class="col-md-10 center rtl article-p">
                أوكي.. ممكن نبداو باراكا من بلا بلا ؟ ههههه
            </p>
            <img class="center article-img" src="{{asset('img/art2-2.png')}}" alt="article2-2">
            <p class="col-md-10 center rtl article-p">
                عمرك سولتي راسك بحال السؤال؟ <br>
                واخا نطرحو عليك بشكل آخر: امتاش كنحس براسي كنخدم مرتاح وكنكون متحفز مزيان؟ <br>
                وضاحت شوية القضية؟ أوكي. <br>
                دابا غنطرق لثلاثة النقط في هاد الموضوع :
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-blue">النقطة الأولى : واحد الرأي غير شائع بين المبرمجين وهو أنه الفياق بكري حسن من أنك تسهر.</h6>
            <p class="col-md-10 center rtl article-p">
                في الحقيقة العقل ديالك كيحتاج ينعس مزيان وغالبا ما أحسن فترة يرتاح فيها هي أنك تنعس كأي إنسان عادي فالليل.. فالليل ماشي الفجر – أودي راحنا خفافيش والله-. هدشي انا براسي مكنتش كنتيقو لكن منين جربت فترة قاديت فيها نعاسي بمشقة الأنفس بعدما كان مخربق بزاااف وكنعس تال الفجر ونوض بكري خصوصا يامات القرايا والبروجيات. لقيت أنه الانتاجية ديالي زادت, كنخدم مرتاحة وماشي مرخية او فيا نعاس, وكنقدر نركز بطريقة افضل ونشوف الامور بمنظور افضل. لذلك إذا كانت عندك الامكانية أنك تقاد نعاسك تكون أفضل ليك ولصحتك. حيت عارفة أنه بزاف دالمرات كنكونوا مضطرين نسهروا.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-blue">النقطة الثانية : الوقت لي كنكون فيه إنتاجي أكثر.</h6>
            <p class="col-md-10 center rtl article-p">
                بمعنى خاصك تعرف أشمن وقت كتكون خدام فيه بكامل تركيز وأريحية. مني كنقول أريحية ماشي معناه أنك مكتعاني لا من ستريس تاع الوقت لا من تعب لا والو.. بل الوقيتة لي كتحس أنك قادر تخدم فيها ومكتحسش بالوقت ونتا خدام فيها ومكتحسش براسك باغي تنعس أو ترتاح وكتكون نشيط أكثر. كل شخص وامتاش هاد الوقيتة كتكون عندو وكذلك حسب الظروف.. كين لي كيكونوا إنتاجيين أكثر فالصباح, كين لي فالعشية, وكين لي فالليل واخا غير صحية ولكن هوما هكاك طبيعتهم.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-blue">النقطة الثالثة : تكتاشف المشروب الطاقي ديالك.</h6>
            <p class="col-md-10 center rtl article-p">
                العبارة أتجي غريبة شوية لكن فعلا مؤثرة هههه.. أغلبية أول مشروب كيجي فبالهم هو القهوة. كون أن الكافيين مادة منشطة, لكن لي معارفينش بزاف دالناس أنه كين لي القهوة كتأثر عليه بشكل عكسي وكتخليه يترخى أكثر, بل الأغرب أنه كين لي أتاي تينشطو والأغرب من ذلك عندي صديق تيحس براسو نشيط أكثر وتركيزو عالي فاش تيشرب الماء بزاف. لذلك ممكن يكون عندك مشروب طاقي خاص بيك لي هو ممعروفش لكلشي تقدر تكون كتشارجي راسك بموناضا ولا بعصير مهم لقى ليك شيحاجة تسقي بيها راسك ونت خدام هههه.
            </p>
            <p class="col-md-10 center rtl article-p">
                أنا شخصيا كنفضل القهوة وأتاي وكنوع ما بيناتهم وتا القهوة مكنشربهاش ديما كحلة لأنه على ما لاحضت فاش كنبقى نشرب واحد فيهم فترة طويلة أو مثلا نوع قهوة واحد فترة طويلة مكتبقاش تقضي فيا بكل بساطة. نصيحة عالخفيف كدا.
            </p>
            <p class="col-md-10 center rtl article-p">
                أوك واش سالينا؟ لا وكنظن باينة حيت هدشي لي قلنا ما هو الا عنصر مساعدة باش المفهومين ولا الطريقتين لي غندوي عليهم دابا غطبق وحدة فيهم أو بجوج على أحسن وجه. علاش ممكن وحدة ممكن جوج غنشوفو.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-pink">الطريقة الأولى : لائحة المهام.</h6>
            <img class="center article-img" src="{{asset('img/art2-3.png')}}" alt="article2-3">
            <p class="col-md-10 center rtl article-p">
                أبسط طريقة هي هادي, أنك كتحط المهام لي عندك فالنهار على شكل لائحة وكل مرة كتسالي شي مهمة منهم كتشطب عليه فحالة ورقة وستيلو وفحالة كنتي كتستعمل شي تطبيق فكتكروشي عليها أنها تدارت.
            </p>
            <p class="col-md-10 center rtl article-p">
                لكن, أنا كنفضل هاد الطريقة فحالة كان عندي الوقت الكامل ديالي وممزروباش أو لا دوك المهام معندهمش علاقة بشي التزامات مهنية ولا دراسية بحيث فهاد الحالة كتكون مضطر تسبق شي حوايج وتساليهم فوقت معين.
            </p>
            <p class="col-md-10 center rtl article-p">
                كذلك الطريقة الأفضل باش تقدر تستافد من هاد اللائحة هو أنك متحاولش تدير ترتيب لدوك المهام. علاش ؟ لأنه خلال النهار مكتعرفش اشنو يطرا وممكن فالصباح مترشقش ليك دير ديك الحاجة لي كتبتي اديرها فالصباح وبالتالي اتبقى تاجل تال العشية اتوصل العشية اتلقى راسك مدرتي تاحاجة غادي يجيك الاحباط وغدير بناقص.
            </p>
            <p class="col-md-10 center rtl article-p">
                لهذا كنفضل أنه الواحد يحط المهام بدون ترتيب باش على الاقل فالنهار غيلقى راسو دار مهمة ولا جوج فعوض مايدير تاحاجة ويدوز نهار فارغ من أي إنتاجية.
            </p>
            <p class="col-md-10 center rtl article-p">
                نقطة أخرى وجب الاشارة اليها تاهي, وهي أنك متحطش التفاصيل ديال التفاصيل, وتكتب فقط المهام الكبار لي خاصك تدير ومتبالغش بزاف. بمعنى ؟ متبقاش تكتب شيحوايج لي هوما روتيينيين غي باش تزيد العدد، هكاك غير كتوهم عقلك انه عندك بزاف ميدار وكيصدق يحسسك بالتعب والاحباط قبلما تبدا, أما المبالغة فكنقصد بيها متحطش مهام أكثر من دكشي لي فعلا قادر تديرو نسبيا كامل فداك النهار.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-pink">الطريقة الثانية : ترتيب المهام حسب الأولوية</h6>
            <img class="center article-img" src="{{asset('img/art2-4.png')}}" alt="article2-4">
            <p class="col-md-10 center rtl article-p">
                أول حاجة هاد الطريقة غالبا مكنخدم بيها فاش تيولي عندي بزاف دالمهام خاصني نساليهم فالنهار وداك المهام عندي مقسمين لشي حوايج لي أولويين وشي حوايج لا. لذلك فبلاصة ما نبقى دايخة ويدوز نهار ونلقى راسي سبقت شيحاجات لي كان ممكن نستغنى عنها أو نأخرها وخليت المهم مدرتوش فكندير هاد الطريقة لي غنشرح دابا كيفاش.
            </p>
            <p class="col-md-10 center rtl article-p">
                فهاد الطريقة كتقسم المهام لي عندك من بعدما كاتحددهم, لربعة الأصناف هوما كالتالي :
            </p>
            <img class="center article-img" src="{{asset('img/art2-5.png')}}" alt="article2-5">
            <p class="col-md-10 center rtl article-p">
                <i class="fa fa-circle" style="color: #0C3D61;font-size: 24px;"></i>
                هادو أعلى درجة, بمعنى إذا كانت عندك شي مهمة عطيتيها هاد الوسم فخاصك تبدا بيها هي اللول لانه كتكون ضرورية ومزروب عليها بجوج.
                <br>
                <i class="fa fa-circle" style="color: #055BB4;font-size: 24px;"></i>
                هادو كيجيو فالرتبة الثالثة, بحكم أنهم كيكونوا غالبا مهام لي هي عندها أهمية كبيرة واخا ممزروبش عليها لذلك يفضل تقضي الغرض قبلما تولي تاهي مستعجلة ومهمة.
                <br>
                <i class="fa fa-circle" style="color: #207AEF;font-size: 24px;"></i>
                كيجيو فالرتبة الثانية بحكم أنهم مهمات مستعجلين وخاصك تساليهم دغيا واخا ما مهمينش.
                <br>
                <i class="fa fa-circle" style="color: #6799DB;font-size: 24px;"></i>
                هادو كيجيو فالرتبة الاخيرة لانه غالبا كيكونوا هوايات ولا شيحاجة بغيتي ديرها لراسك فقط استفادة شخصية بمعنى ما داخلش فيها شي التزامات خارجية كتضغط عليه لذلك ما مهمة ما مستعجلة.
            </p>
            <p class="col-md-10 center rtl article-p">
                فاش كتقسم المهام تاعك فالنهار لهاد الاقسام كتولي عارف أشنو تسبق وأشنو توخر ومكتصدقش مضيع النهار فمهام لي كان ممكن تأجلهم أو تستغنى عنهم بشكل كامل عوض يضيع النهار في الخوا الخاوي.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-beige">الخلاصة:</h6>
            <ul>
                <li class="col-md-10 rtl article-li"> اكتشف الوقت لي كتقدر تعطي فيه أكثر.</li>
                <li class="col-md-10 rtl article-li">طبق طريقة لائحة المهام فاش تكون معندكش التزامات خارجية.</li>
                <li class="col-md-10 rtl article-li">طبق طريقة الوسوم والأولويات فاش تكون عندك التزامات وأوقات محددة مجبر أنك تبعها.</li>
            </ul> 
            <br>
            <h6 class="col-md-10 center rtl article-subheader text-pink">ملاحظة:</h6>
            <p class="col-md-10 center rtl article-p">
                ماشي بالضرورة تكون هاد الطرق مناسباكم لكن النصيحة لي نقدر نعطيكم أنكم إذا لقيتو شي طريقة سواء من هادو أو وحداخرين لقيتهم فانترنيت ممناسباكمش حاولو تدونو علاش ممناسباكمش هاكا غتعرفو الأسباب وبالتالي غتقدروا تلاقاو من بعد طريقة أخرى مفيهاش دوك الأسباب ومناسباكم – او ممكن تختارعوها لنفسكم-
            </p>
            <p class="col-md-10 center rtl article-p">
                الطريقة ديال الاولويات عندها اسم على ما اعتقدد لكن نسيتو أنا أخدتها من محاضرة حضرتها شي عامين دابا لذلك معقلتش وما اهتميتش نقلب بقدر ما همني المفهوم وصاف.
            </p>
            <h6 class="col-md-10 center rtl article-subheader text-blue">إضافات :</h6>
            <p class="col-md-10 center rtl article-p">
                لي كيرتاح فورقة وستيلو بحالي في حالة tsiL oD oT يديرها حيت فعلا تنتحمس مني كنشطب على شي مهمة بستيلو هههههه, أما لي عزيز عليه التكنولوجيا راه كين بزاف دتطبيقات في الهاتف ولا فينما بغيتو كتبو نفس السمية يطلع ليكم العجب.
            </p>
            <p class="col-md-10 center rtl article-p">
                أما بالنسبة للأولويات فكنفضل نستخدم ollerT هو تطبيق تقدرو تديروه فبييسي ولا تلفون ولا تحلوه من الويب فينما بغيتو أتلقاوه, كنفضلو حيتاش فيه بزاف دالخصائص كيعاونوني فتنظيم الوقت والخدمة لا من حيث الوسوم لي فيه بالالوان ولا من ناحية بزاف دالحوايج نقدر من بعد نكتب عليه شي مقال مفصل.
            </p>
            <p class="col-md-10 center rtl article-p">
                داير بهاد الشكل(هنا تقدرو تشوفو كيفاش قسمت المهام لي عندي مثلا).
            </p>
            <img class="center article-img" src="{{asset('img/art2-6.png')}}" alt="article2-6">
            <p class="col-md-10 center rtl article-p">
                نتمنى نكون فدتكم, لي عندو أي إضافة أو انتقاد بناء مرحبا والف مرحبا حنا هنا باش كنتبادلو المعرفة والخبرة تاعنا جميع.
            </p>
            {{-- STANDARDS --}}
            {{-- <img class="center article-img" src="{{asset('img/art2-3.png')}}" alt="article2-3"> --}}
            {{-- <h6 class="col-md-10 center rtl article-subheader text-pink"></h6> --}}
            {{-- <p class="col-md-10 center rtl article-p"></p> --}}
        </div>
    </div>
@endsection