@extends('layout')
@section('content')
    <div class="container-fluid" style="padding: 30px">
        <div class="bg-light rounded">            
            <img class="center article-img" src="{{asset('img/art3.png')}}" alt="article3-1">
            <p class="col-md-10 center rtl article-p">
                هاد السؤال سولوه ليا بزااف دناس بصح بزاف دناس و من مختلف الاعمار لي فالباك لي صغر لي فالتعليم العالي لي ديجا تخرج من شي مجال اخر ومهتم بعالم البرمجة.
            </p>
            <p class="col-md-10 center rtl article-p">
                هاد الموضوع لا جيت نحصروا كامل شخصيا اتجيني صعيبة لأنني باقي معنديش خبرة كبيرة بزاف باش نعطي واحد التوجيه صائب ومهما درت غادي يبقى هاد المقال بمثابة رأي. يقدر يروي عطشكم كيفما يقدر يزيد يعطشكم 😂
            </p>
            <p class="col-md-10 center rtl article-p">
                لكن فكرت بما أنه بزاف لي تيسولوني عليه من الاصدقاء وتا ناس متنعرفهمش .. وبما أنني بديت مؤخرا كتابة المقالات .. فعلاش لا نكتب مقال واحد نحاول ما أمكن نجمع فيه أفكاري كاملين بخصوص هاد الأمر ونبقى نصيفطو لأي واحد سولني.
            </p>
            <p class="col-md-10 center rtl article-p">
                أول مبدأ كتعلموا كمبرمج .. الى عندك شي عملية تديرها أكثر من جوج دالمرات .. برمجها تولي dradnatS ✔
            </p>
            <p class="col-md-10 center rtl article-p">
                أوكي أوكي أوكي منيييين نبداو. أولا مجيتش هنا باش نجاوبكم جواب قاطع حيت مكينش واخاا فغالبية الاحيان كنحاول نعطي جواب قاطع انطلاقا من تجربتي الشخصية لانه صعيب نقول هدشي كامل لغتقراوه لكل واحد سولني من دوك ناس كاملين.
            </p>
            <p class="col-md-10 center rtl article-p">
                باش تدخل لهاد المجال وتمشي فيه مزيان خاصك تكون عندك وحدة من هاد جوج وإذا كانو بجوج فيك تكون مخيرة كاع.
            </p>
            <img class="center article-img" src="{{asset('img/art3-2.png')}}" alt="article3-2">
            <p class="col-md-10 center rtl article-p">
                ممكن تدخل لعالم البرمجة والمعلوميات حيتاش نتا شغوف بهدشي من مدة, وكتعجبك أي حاجة عندها علاقة بالحاسوب. كتحس بالنشوة والاستمتاع فاش كتقرا أي حاجة عندها علاقة بهدشي وديماا متحمس للجديد ولتطوير نفسك فهاد المجال مزال.
            </p>
            <p class="col-md-10 center rtl article-p">
                كيفما ممكن تكون دخلتي بشكل تقليدي لهاد المجال من خلال أنك قريتيه فشي مدرسة أو كلية ورا الباك, كترتاح فيه لكن ماشي لدرجة الشغف وعليه فا نتا كتخدم فيه مزيان وكدا لكن فقط داك الشغف والسعي لمستويات افضل واجمل من دون استدعاء ضرورة ملحة معندكش, فهاد الحالة أنا سميتها تتخدم على راسك .. ماشي عيب كل واحد حر فنفسه إدا كنتي كتقراه من أجل العمل فقط وتصور طرف دالخبز هداك شيحاجة لي حريتك.. لكن فقط كنوضح الأنواع لي ممكن يكملو فالضومين.. بحيت نتا فهاد الحالة اتكمل فيه لانه بالنسبة ليك ضرورة معيشية.
            </p>
            <p class="col-md-10 center rtl article-p">
                وممكن يكونوا عندك بجوج تكون شغوف وفنفس الوقت كتخدم على راسك.
            </p>
            <p class="col-md-10 center rtl article-p">
                دابا نوضحو بعض النقط فهاد الاطار.
            </p>
            <p class="col-md-10 center rtl article-p">
                أول الحاجة الأصدقاء لي تيقوليكم لانفورماتيك مافيهش الشوماج وفيه الحبة راه مكيقولش ليكم لانفورماتيك جنة بلا حدود. وغتبداو تعومو فالفلوس وتصفقو بايديكم يوقف عليكم صف ديال الخداما يدير ليكم ما بغيتو وطوموبيلات كيتشايرو والفيلاا قداش. لا لا لا. فيقوا معايا الله يرضي عليكم.
            </p>
            <p class="col-md-10 center rtl article-p">
                لانفورماتيك بصح ما فيهش شوماج بزاف ولكن لمن ؟ لدوك جوج دنواع لي قلت الفوق .. لانه سواء كان شغفك ولا ضرورة تصور طرف دالخبز بيه (ولاحظو معايا هنا أنني سبق وذكرت باللي مرتاح فيه وفطريقة الخدمة فهاد المجال في الفقرة لي قبل يعني ماشي باغي يصور طرف دالخبز وفنفس الوقت كاره ضومين لا) مهم وحدة فيهم أو بجوج مخلينك تقراه وتخدم فيه مغتقدرش عليه تيقني مغتقدرش عليه.
            </p>
            <p class="col-md-10 center rtl article-p">
                علاش؟
            </p>
            <p class="col-md-10 center rtl article-p">
                لانفورماتيك هو واحد ضومين لي كيتطور بشكل كبير وبسرعة كبيرة كتر ديما الجديد ديما نتا كتجري ورى واحد تران VGT والحاجة الوحيدة لي ممكن تعطيك السوفل هي جوج أسباب لي قلت الفوق.
            </p>
            <p class="col-md-10 center rtl article-p">
                بالنسبة للفلوس, داك نيفو لي كتسمعو عليه راه مكيوصل ليه الواحد حتى كيدوز الخبرة سنين وكيتكرفص واخا يكون فريلانس علاه الفريلانس المبرمج فيه مكياخدش وقتو في التعلم واكتساب تقنيات جديدة وخبرة مهنية ؟. عاد زيد الوقت باش يكسب كليان ويدير سمعة وسط المبرمجين لاخرين ويبدا يجيب بروجيات كبار لي يجيبو ليه الفلوس.
            </p>
            <p class="col-md-10 center rtl article-p">
                ديك الملايين فشهر من دقة اللولة مكيناش إلا لكان عندك boj ediS كتبيع الحشيش ولا المخدرات أيا كان نوعها🤣
            </p>
            <p class="col-md-10 center rtl article-p">
                ودائما غنرجعو للنقطة الاولى .. وهي يتوفروا فيك دوك جوج صفات.
            </p>
            <p class="col-md-10 center rtl article-p">
                مع أنني كنأكد على شغوف ولا على الاقل مرتاح فطريقة سير العمل فهاد ضومين حيت سينون واخا تكون مضطر تخدم فيه غتعيش العذاب النفسي. لكن على أي.
            </p>
            <p class="col-md-10 center rtl article-p">
                واخا واخا واخا. دابا ها أنا شغوف ولا عندي سبب يخليني ندخل هاد المجال باش نبدا ؟
            </p>
            <p class="col-md-10 center rtl article-p">
                فالحقيقة هدا سؤال صعيب بزاف .. ونقدر نتفهمكم بما أنني دزت من هاد التجربة.
            </p>
            <p class="col-md-10 center rtl article-p">
                أنا دخلت لانفورماتيك وأنا عندي فكرة واحدة كيعجبني نخدم فالبيسي. من أنا وصغيرة ديما فالبيسي يا كنلعب يا كنتفرج فافلام يا كنجرب فشي لوجيسييل يا نبقى نخربق فالملفات تندير ليهم شي زبلة فالبيسي يا مدخلة ليهم شي فيروس..عاد يامات الاعدادي بديت نتعلم للمونطاج وتنخربق مرة مرة ديزااين دكشي حااامض دك ساعات.. وفليسي شوية ركزت على دكشي مي فالسيزيام حبست ديزاين ومونطاج وغنرجع ليهم ورى الباك.
            </p>
            <p class="col-md-10 center rtl article-p">
                فاش دخلت تصدمت بزاف هدشي كاامل كان كيطرا فالبيسي عاد عرفت شنو هي البرمجة شنو هي لغة البرمجة شنو هو erianib مهم تصدمت صدمة العمر وبحكم مكنت عارفة والو على هدشي كنت غي كنشوف شي دري معانا جاوب على شيحاجة تقنية تيبقى فيا الحال لي علاش معرفتش هدشي بكري وكنشوف راسي معطلة بزاف وصاف وليت دايخة ومعارفة اشنو نشد خصوصا منين بدا دكشي كيكثر عليا ومبقيت عارفة علاياش نقلب واشنو نشد واخا نقلب فالانترنت كندوخ مع كين جانب تيقلب راسو وجانب خدام على دكشي لي فالمدرسة.
            </p>
            <p class="col-md-10 center rtl article-p">
                وهنا غنصحكم بواحد الحاجة لي عاوناتني نحيد داك الضبابية مع الوقت هو نحضر للملتقيات ديال ضومين وأي tnemenévé عندو علاقة بهدشي ولا لايف ولا فيديوات في يوتيوب ماشي فيديوات تعليمية .. نوعا ما فيديوات تثقيفية غنخلي ليكم بعض الاقتراحات في الاخر ديال المقال بخصوص هدشي كامل.
            </p>
            <p class="col-md-10 center rtl article-p">
                فاش كتخالط مع ناس ديال ضومين خاصة لي فايتينك فالخبرة كتبدا بشوية بشوية كتندمج فهادشي فاللول منعودش ليكم تيبانليكم داوين بالشينوية بلا ما ندويو على الأسئلة والمواقف المحرجة ههههه لكن مع الوقت وأي حاجة سمعتيها مرة مرة تحاول تقلب عليه تتبدا توضاح الرؤية بحال شي elzzup.
            </p>
            <p class="col-md-10 center rtl article-p">
                دونك كنت كنحاول أي فرصة كنقدر نتلاقا فيها ناس فايتيني فالضومين كنستغلها. وهدشي بالموازاة مع أنني نحاول ولو على الاقل نواكب شوية دكشي دالمدرسة والحمد لله على الاقل بالنسبة ليا كوحدة بدات من زيرو راه كنت غادة مزيان ومع المدة لقيت أنه ضومين عجبني كثر وبزااف و ولا الاستكشاف ديالو متعة بالنسبة ليا.
            </p>
            <p class="col-md-10 center rtl article-p">
                مهم طراو بزاف دالحوايج من بعد لي مغنعاودهمش هنا والا غيجي المقال طويل بزاف ممكن نكتب عليهم مرة اخرى فقط كمصدر لي ممكن يعاون الاشخاص لي طاحو في وضعية بحالي يلقاو ارشادات ونصائح.
            </p>
            <p class="col-md-10 center rtl article-p">
                انطلاقا من تجربتي ومن بوسط كنت حطيتو فالفيسبوك سولت فيه مبرمجين آخرين من وجهة النظر ديالهم شنو ينصحو واحد عاد بادي الميدان غنعطيكم اقتراحات فقط .. انما باب الولوج لهاد الضومين كيبقى مفتوح لطرق متعددة.
            </p>
            <h6 class="col-md-10 center rtl article-subheader" style="color: #827395">غنعطيكم ثلاث اقتراحات لي شائعة بزاف بين المبتدئين</h6>
            <img class="center article-img" src="{{asset('img/art3-3.png')}}" alt="article3-3">
            <p class="col-md-10 center rtl article-p" style="color: #2F2E41;">
                <i class="fa fa-bookmark" style="color: #2F2E41;font-size: 34px;"></i>
                الاقتراح الاول : تبدا بشيحاجة لي فيها الخدمة وتهراس راس ونقدروا نقولو شوية قاصحة ومساهلاش لأي واحد.
            </p>
            <p class="col-md-10 center rtl article-p">
                أنك تبدا بلغة البرمجة C لي هي لي بديت بيها انا بحكم بديت فالضومين دالبرمجة مع المدرسة. هاد اللغة هي قريبة بزاف من لغة الحاسوب .. وفيها نت كتصوب كلشي راسك مكين شيحاجة لي تدير ليك بحال العضى السحرية وتعاونك تقاد شي حوايج زوينين بسهولة.
            </p>
            <p class="col-md-10 center rtl article-p">
                هو غالبا كتقرا هي اللولة عندها فالمدارس لأنها كتعلمك تعتمد على راسك وتهرس راسك باش تلقى الحل ديال واحد المشكل معين, كذلك مكتعلمكش العكز وتلقى كلشي قريب ليك بشكل أو بآخر وكذلك أي مفهوم خدمتي عليه كتعرف أشنو بالضبط كيطرا فيه على عكس اللغات الاخرى كين بعض المفاهيم لي العمليات لي كيطراو وسط منهم كيتمو وراء الكواليس.
            </p>
            <p class="col-md-10 center rtl article-p">
                على العموم كتبقى هاد اللغة صعبة بالمقارنة مع اللغات الاخرى من ناحية التعلم والتطبيق حيت كيفما قلت كلشي كديرو راسك.
            </p>
            <p class="col-md-10 center rtl article-p">
                لكن كرأي شخصي وتجربة شخصية لي ماشي بالضرورة تنطابق عليك كيفما ممكن تنطابق عليك : فأنا عجباتني بزاف وصعوبتها بالنسبة ليا كانت تحدي وكيعجبني نبقى مضاربة مع شيحاجة فيها تنقادها خصوصا انه فداك الوقيتة هدكشي كامل كان جديد عليا دونك أي حاجة درتها بيها كنت كنتحمس معاها وكنا كنقراو بالموازاة معاها الخوارزميات.
            </p>
            <p class="col-md-10 center rtl article-p">
                غير ذلك لحد الان كنلقى الوقع ديالها باقي فيا بمعنى فاش كنجي نكتب شي كود كنفكر مزيان كيف غندير ليه وكنحاول نرتب دكشي مزيان بحيث يكون مفهوم ومنظم وكنركز على التفاصيل.
            </p>
            <p class="col-md-10 center rtl article-p">
                عاوتاني وراها ما حسيتش بأن شي لغة صعبة في المرحلة اللولة ديالها بمعنى فاش يلاه كتبدا تعلمها حيت داك صعوبة التلقي لي كتكون فاللول تجاوزتها مع C.
            </p>
            <p class="col-md-10 center rtl article-p">
                غالبا هي لي كنصح بيها ناس رغم انه بزاف كيفضلو لا بحكم انه ممكن تخلي الواحد يكره ضومين .. مع انه انا كنشوف باللي دائما البداية بالأساسيات كتبقى أفضل طريقة تبدا بيها أي مجال مغنجيش تنوصل فين عاد نبدا كل مرة نرجع نرقع شيحاجة لي مفروض انها خاصها تكون فالساس ديال البناية لي هي المعرفة فهاد السياق.
            </p>
            <p class="col-md-10 center rtl article-p">
                لكن كيبقى رأي وتجربة شخصيين ممكن يوالموك وتتافق معايا كيفما ممكن العكس.
            </p>
            <p class="col-md-10 center rtl article-p" style="color: #827395;">
                <i class="fa fa-bookmark" style="color: #827395;font-size: 34px;"></i>
                الاقتراح التاني : تبدا بشيحاجة متوسطة الصعوبة ماشي ساهلة وماشي صعيبة.
            </p>
            <p class="col-md-10 center rtl article-p">
                اغلبية كيبداو بلغات OOP لي كيكنوا سهلين فالتعلم والتطبيق والنتائج ديالهم كيكونوا شوية اسرع من الاقتراح اللول .. أما فاش كتبدا تصوب واجهة المستخدم ولا ecafretnI وكتستيليه كيف بغيتي ولعيبات وكتفرااح خلاص لخدمتي فيه شي بوطونة داك النهار الحفلة.
            </p>
            <p class="col-md-10 center rtl article-p">
                من بين هاد اللغات لي عندهم هاد الميزة كين cte …avaJ ,++C.
            </p>
            <p class="col-md-10 center rtl article-p">
                كين عاوتاني لي كيبدا بالskrowmarF وكيتمى هابط.
            </p>
            <p class="col-md-10 center rtl article-p">
                كإشارة مني كنقول سهلة ولا صعيبة فقط بالنسبة لواحد مبتدئ إنما راه غير كتعيق بالقالب كيفاش تتعلم مزيان شي لغة كيفاش تقلب على مصادر منين تتعلم كيفاش طور راسك فيها راه مكيبقى يبانليك والو صعيب تتولي تبانليك مسألة بحث وبذل جهد وصاف. غي باش ميجيكمش احباط ولا تستهزؤوا بقيمة شي اقتراح او لغة معينة.
            </p>
            <p class="col-md-10 center rtl article-p" style="color: #8C52FF;">
                <i class="fa fa-bookmark" style="color: #8C52FF;font-size: 34px;"></i>
                الاقتراح الثالث : هو تبدا بشيحاجة لي نسبيا ساهلة فاللول وكتبان النتيجة ديالها بالزربة.
            </p>
            <p class="col-md-10 center rtl article-p">
                تبدا SSC & LMTH هادد جوج لغات ماشي لغات برمجة هادو فقط لغة بناء والثانية لغة تصميم وهوما معروفين بزاف فالويب حيت هوما الاساس دونك غالبا ما أي واحد كيبغي يدخل ضومين ضروري يكون سمع بيهم فمجال الويب على الخصوص.
            </p>
            <p class="col-md-10 center rtl article-p">
                هادو زوينين للناس لي باغين غير يلونصيو راسهم ويستأنسو بضومين شوية يلعبو شوية فالتصميم ديال الصفحات وكدا ويشوفو دكشي واش يعجبهم ولا ولا و من بعد يكتشفو حوايج آخرين.
            </p>
            <img class="center article-img" src="{{asset('img/art3-4.png')}}" alt="article3-4">
            <p class="col-md-10 center rtl article-p">
                في الاخير كتبقى نتا لي قادر تختار شنو مناسبليك وشنو موالمك حيت نتا لي عارف راسك وشخصيتك واش نتا صبار وعزيز عليك التحديات واش عزيز عليك تبدا بالسهال وتبقى غادي طالع للصعيب ولا تبغي تتهنى من صعيب عاد ترجع للساهل. ختار نتا شنو لي يريحك وميكرهكمش فالضومين.
            </p>
            <p class="col-md-10 center rtl article-p">
                كيف قلتليكم باش تكتشفوا الضومين مزال مزيان وتقدروا تختارو شنو غتبداو خاصكم تعرفو بعدا راسكم فين غادين واشنو باغين من هاد ضومين بالضبط. وباش تعرفو كيف قلت خاصكم تلاقاو بناس فايتينكم ولا تحضروا لملتقيات دابا مع كورونا راه كيكونوا ملتقيات ومحاضرات اونلاين غي مشتتين باللغة لي بغيتي عربية فرنسية انجليزية ولا حتى درجة.
            </p>
            <p class="col-md-10 center rtl article-p">
                الاقتراحات لي عندي ليكم راه بزاااف لي نقدر نشاركهم معاككم فانستغرام لكن اهمها ولي كيبانلي حاليا ممكن تعطيكم نظرة شاملة على الضومين:
            </p>
            <p class="col-md-10 center rtl article-p">
                هي هاد السلسلة بالانجليزية : 
                <a href="https://www.youtube.com/watch?v=tpIctyqH29Q&list=PLH2l6uzC4UEW0s7-KewFLBC1D0l6XRfye">هنا</a>
            </p>
            <p class="col-md-10 center rtl article-p">
                وهاد برنامج بودكاست ولي كيدوز بالدارجة تاهو لا تبعتو حلقاتو اتشكلو ثقافة عامة على الضومين : 
                <a href="https://geeksblabla.com/blablas"> هنا</a>
            </p>
        </div>
    </div>
@endsection